brew "bash-completion"
# Run:
# echo /opt/homebrew/bin/bash | sudo tee -a /etc/shells
# chsh -s /opt/homebrew/bin/bash
cask "font-comic-shanns-mono-nerd-font"

brew "tmux"
brew "rsync"
brew "watch"
brew "jq"
brew "btop"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "difftastic"
brew "gh"
brew "dotter"

# Development tools
brew "uv"
brew "gh"
brew "samply"
brew "z3"

# Docker/VM
brew "helm"
brew "lima"

# Linters / compilers
brew "cspell"              #
brew "rust-analyzer"       # Rust LSP
brew "bacon"               # Rust helper
brew "stylua"              # Lua
brew "lua-language-server" # Lua LSP
brew "rumdl"               # Markdown
brew "markdown-oxide"      # Obsidian LSP
brew "shellharden"         #
brew "sqlfluff"            # SQL
brew "yamlfmt"             # Yaml
brew "yamllint"            # Yaml
brew "ruff"
brew "ty"

# Apps
# cask "alacritty"
brew "zellij"
# cask "google-chrome"

# AI
cask "claude-code"
cask "codex"
brew "gemini-cli"
