brew "bash"
brew "bash-completion"
# Run:
# echo /opt/homebrew/bin/bash | sudo tee -a /etc/shells
# chsh -s /opt/homebrew/bin/bash
cask "font-comic-shanns-mono-nerd-font"

# CLI tools
brew "neovim"
brew "moreutils"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "wget"
brew "curl"
brew "git"
brew "tree"
brew "tmux"
brew "rsync"
brew "watch"
brew "less"
brew "jq"
brew "btop"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "difftastic"
brew "gh"
brew "dotter"

# Development tools
brew "rustup" # Run rustup init
brew "rust-analyzer"
brew "bacon"
brew "datafusion"
brew "uv"
brew "llvm"
brew "gcc"
brew "make"
brew "cmake"
brew "samply"
brew "z3"
tap "pulumi/tap"
brew "pulumi"
brew "awscli"


# Docker/VM
brew "helm"
brew "lima"
brew "lima-additional-guestagents"
brew "qemu"
brew "openssh"

# Linters / compilers
brew "cspell"              #
brew "rust-analyzer"       # Rust LSP
brew "stylua"              # Lua
brew "lua-language-server" # Lua LSP
brew "rumdl"               # Markdown
brew "markdown-oxide"      # Obsidian LSP
brew "shellharden"         #
brew "sqlfluff"            # SQL
brew "yamlfmt"             # Yaml
brew "yamllint"            # Yaml
brew "ruff"
brew "ty"


# Apps
cask "firefox"
cask "alacritty"
brew "zellij"
cask "google-chrome"
cask "karabiner-elements"
cask "raycast"
cask "yubico-authenticator"
cask "tailscale-app"
brew "tailscale"
cask "1password"
cask "1password-cli"

# Multimedia
cask "logitech-g-hub"
cask "obs"
brew "mpv"
brew "ffmpeg"

# AI
cask "claude-code"
cask "codex"
brew "opencode"
